; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	satellite4 - satellite
	instrument5 - instrument
	image2 - mode
	infrared3 - mode
	thermograph0 - mode
	spectrograph4 - mode
	image1 - mode
	Star1 - direction
	GroundStation3 - direction
	GroundStation6 - direction
	Star9 - direction
	Star8 - direction
	Star4 - direction
	Star2 - direction
	GroundStation7 - direction
	Star5 - direction
	GroundStation0 - direction
	Phenomenon10 - direction
	Star11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 infrared3)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 Star8)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star8)
	(supports instrument1 spectrograph4)
	(supports instrument1 image2)
	(supports instrument1 infrared3)
	(calibration_target instrument1 Star4)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
	(supports instrument2 thermograph0)
	(supports instrument2 image2)
	(calibration_target instrument2 Star5)
	(supports instrument3 image2)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation0)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon10)
	(supports instrument4 infrared3)
	(supports instrument4 thermograph0)
	(supports instrument4 image1)
	(calibration_target instrument4 GroundStation7)
	(calibration_target instrument4 Star2)
	(on_board instrument4 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star5)
	(supports instrument5 infrared3)
	(calibration_target instrument5 GroundStation0)
	(calibration_target instrument5 Star5)
	(calibration_target instrument5 GroundStation7)
	(on_board instrument5 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation0)
)
(:goal (and
	(pointing satellite3 Star1)
	(pointing satellite4 Star12)
	(have_image Phenomenon10 spectrograph4)
	(have_image Star11 spectrograph4)
	(have_image Star12 spectrograph4)
))

)

; plan
1. (turn_to satellite1 star4 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 star4)
   goals met: 0 of 5
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 5
3. (calibrate satellite1 instrument1 star4)
   added: (calibrated instrument1)
   goals met: 0 of 5
4. (turn_to satellite1 star11 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 star11)
   goals met: 0 of 5
5. (take_image satellite1 star11 instrument1 spectrograph4)
   added: (have_image star11 spectrograph4)
   goals met: 1 of 5
6. (turn_to satellite1 phenomenon10 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 phenomenon10)
   goals met: 1 of 5
7. (take_image satellite1 phenomenon10 instrument1 spectrograph4)
   added: (have_image phenomenon10 spectrograph4)
   goals met: 2 of 5
8. (turn_to satellite1 star12 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 star12)
   goals met: 2 of 5
9. (take_image satellite1 star12 instrument1 spectrograph4)
   added: (have_image star12 spectrograph4)
   goals met: 3 of 5
10. (turn_to satellite3 star1 star5)
   deleted: (pointing satellite3 star5)
   added: (pointing satellite3 star1)
   goals met: 4 of 5
11. (turn_to satellite4 star12 groundstation0)
   deleted: (pointing satellite4 groundstation0)
   added: (pointing satellite4 star12)
   goals met: 5 of 5
